function Experience() {
    return (
        <section>
            <h2>Навчальні проєкти</h2>
            <article>
            <h3>Розробка персонального сайту-резюме</h3>
            <p><em>Лютий 2026 – Теперішній час</em></p>
            <ul>
                <li>Створення семантичної структури сайту на HTML5.</li>
                <li>Використання React для створення компонентної архітектури.</li>
                <li>Керування версіями коду за допомогою Git та GitHub.</li>
            </ul>
            </article>

            <article>
            <h3>Система шифрування (Parallel Computing)</h3>
            <p><em>Грудень 2025 – Січень 2026</em></p>
            <ul>
                <li>Реалізація алгоритму шифрування на GPU з використанням CUDA/OpenCL.</li>
                <li>Оптимізація обчислень для роботи з великими обсягами даних.</li>
            </ul>
            </article>

            <article>
            <h3>Сканер директорії з використанням YARA-правил</h3>
            <p><em>Осінь 2025</em></p>
            <ul>
                <li>Розробка Python-програми для перевірки файлів на наявність malware.</li>
                <li>Інтеграція YARA-правил для виявлення шкідливого ПЗ.</li>
                <li>Аналіз результатів сканування та формування звіту.</li>
            </ul>
            </article>

            <article>
            <h3>Веб-сайт для ChessClub (PHP + MySQL)</h3>
            <p><em>Травень - Червень 2025</em></p>
            <ul>
                <li>Розробка веб-інтерфейсу для шахового клубу.</li>
                <li>Створення динамічних SQL-запитів із використанням JOIN на основі вибраних таблиць і колонок.</li>
                <li>Розробка сторінки з пошуком, сортуванням та модальними вікнами для перегляду PDF/відео.</li>
                <li>Робота з MariaDB (створення подань, тригерів, групування, сортування, об'єднання таблиць).</li>
            </ul>
            </article>

            <article>
            <h3>Angular-проєкт із використанням Bootstrap</h3>
            <p><em>Жовтень 2024 - Січень 2025</em></p>
            <ul>
                <li>Розробка SPA-застосунку з чотирма сторінками: mainpage, board, map, forum.</li>
                <li>Реалізація постійної навігаційної панелі.</li>
                <li>Використання компонентної архітектури Angular.</li>
                <li>Інтеграція Bootstrap для стилізації інтерфейсу.</li>
            </ul>
            </article>
        </section>
    );
}
export default Experience;